---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilyHostingBehavior
source: html/a0e4ee62-6328-2065-32cd-5e5d6bccd0c6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilyHostingBehavior Property

"Host"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilyHostingBehavior { get; }
```